maoravni/Dev/FEC/Common/PssFramework/Peripherals/PSoC/PsocHandler.cpp
/*
 * PsocHandler.cpp
 *
 *  Created on: 24 бреб 2013
 *      Author: maora
 */

//#include "PsocMessageStruct.h"
#include "PsocHandler.h"
#include <assert.h>
#include <stdio.h>
#include <FreeRTOS.h>
#include <semphr.h>
#include <PscServer/PscMasterServer.h>

extern "C" xSemaphoreHandle psocSpiResponseCompleteSemaphore;
extern "C" T_PsocSpiReceiveFrame psocSpiResponseBuffer;

PMHGetVersion g_getVersionHandler;
PMHKeepAlive g_keepAliveHandler;
PMHReadTemperaturePwmDISensors g_readTemperaturePwmDISensorsHandler;
PMHReadAnalogsFeedbacksErrors g_readAnalogsFeedbacksErrors;
PMHGetPsocStatus g_getPsocStatus;
PMHConfigTemperatureSensor g_configTemperatureSensor;
PMHGetCableID g_getCableId;
PMHWriteMultipleDevices g_writeMultipleDevices;
PMHStartErrorRecovery g_startErrorRecovery;
PMHStartBoardConfig g_startBoardConfig;
PMHEndBoardConfig g_endBoardConfig;
PMHConfigCurrentLoop g_configCurrentLoop;
PMHConfigDigitalIO g_configDigitalIO;
PMHConfigAnalogIO g_configAnalogIO;
PMHConfigChannelFunction g_configChannelFunction;
PMHStartBootloader g_startBootloader;

#ifdef WIN32
#define M_PSOC_REQUEST_PROLOGUE(frame) frame = popFrameFromPool(); \
                                if (frame == NULL) \
																                                { \
                                    M_LOGGER_LOGF(M_LOGGER_LEVEL_FATAL, "---No empty frame!---"); \
                                    return E_PsocSpiError_HandlerFrameOverwritten; \
																                                }
// no semaphore was popped, so we break and return an unexpected error.
#define M_PSOC_REQUEST_BLOCKING_EPILOGUE(frame) frame->completeSemaphore = completeSemaphore; \
                                                if (frame->completeSemaphore == NULL) \
												                                                { \
                                                    M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d: No free semaphores available", m_psocIndex); \
                                                    return E_PsocSpiError_NoAvailableSemaphore; \
												                                                } \
                                                portBASE_TYPE semResult = frame->completeSemaphore->take(M_COMPLETE_SEMAPHORE_TIMEOUT); \
                                                frame->completeSemaphore = NULL; \
                                                if (semResult != pdTRUE) \
												                                                { \
                                                    M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d: No slave response, complete semaphore timeout", m_psocIndex); \
                                                    return E_PsocSpiError_NoSlaveResponse; \
												                                                }
#else
#define M_PSOC_REQUEST_PROLOGUE(frame) frame = popFrameFromPool(); \
                                if (frame == NULL) \
								                                { \
                                    M_LOGGER_LOGF(M_LOGGER_LEVEL_FATAL, "---No empty frame!---"); \
                                    return E_PsocSpiError_HandlerFrameOverwritten; \
								                                }
// no semaphore was popped, so we break and return an unexpected error.
#define M_PSOC_REQUEST_BLOCKING_EPILOGUE(frame) frame->completeSemaphore = completeSemaphore; \
                                                if (frame->completeSemaphore == NULL) \
                                                { \
                                                    M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d: No free semaphores available", m_psocIndex); \
                                                    return E_PsocSpiError_NoAvailableSemaphore; \
                                                } \
                                                portBASE_TYPE semResult = frame->completeSemaphore->take(M_COMPLETE_SEMAPHORE_TIMEOUT); \
                                                frame->completeSemaphore = NULL; \
                                                if (semResult != pdTRUE) \
                                                { \
                                                    M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d: No slave response, complete semaphore timeout", m_psocIndex); \
                                                    return E_PsocSpiError_NoSlaveResponse; \
                                                }
#endif

CompleteSemaphorePool::CompleteSemaphorePool()
{
    m_semaphorePool.create(M_SEMAPHORE_POOL_SIZE, sizeof(CBinarySemaphore*));
    for (int i = 0; i < M_SEMAPHORE_POOL_SIZE; ++i)
    {
        m_semaphoreArray[i].create();
        m_semaphoreArray[i].take(10000);
        returnSemaphore(&m_semaphoreArray[i]);
    }
}

void CompleteSemaphorePool::reset()
{
    int i;
    for (i = 0; i < M_SEMAPHORE_POOL_SIZE; ++i)
    {
        popSemaphore(0);
    }
    for (i = 0; i < M_SEMAPHORE_POOL_SIZE; ++i)
    {
        m_semaphoreArray[i].take(0);
        returnSemaphore(&m_semaphoreArray[i]);
    }
}

SpiFramePool::SpiFramePool()
{
    m_spiFramePool.create(M_FRAME_ARRAY_SIZE, sizeof(T_SpiFrameStruct*));
    for (int i = 0; i < M_FRAME_ARRAY_SIZE; ++i)
    {
        returnFrame(&m_spiFrameArray[i]);
    }
}

void SpiFramePool::reset()
{
    int i;
    // we need to reset the frame pool queue, so we first pop every element, and then return it back.
    for (i = 0; i < M_FRAME_ARRAY_SIZE; ++i)
    {
        popFrame(0);
    }
    for (i = 0; i < M_FRAME_ARRAY_SIZE; ++i)
    {
        returnFrame(&m_spiFrameArray[i]);
    }
}

PsocHandler::PsocHandler()
{
    int i;
    m_gpioPort = NULL;
    m_gpioPin = 0;
    m_cableId = 0;

#ifdef PIPELINED
    m_requestFrame = NULL;
    m_replyFrame = NULL;
#else
    m_activeFrame = NULL;
#endif

//    m_spiFrameHandlerQueue.create(2, sizeof(T_SpiFrameStruct*));

    for (i = 0; i < E_PsocDeviceType_Size; ++i)
    {
        m_pendingUpdate[i] = E_DeviceWriteState_Idle;
    }

    memset(m_pwmOutputs, 0, sizeof(m_pwmOutputs));
    m_pendingUpdateCount = 0;
    m_digitalPwmOutputsVerifyErrorCount = 0;
    m_lastSerialNumber = 0;

    m_systemStatus = 0;
    m_errors = 0;
    m_warnings = 0;

    m_shadowPwmControlPulseCounter = 0;
    m_shadowPeakAccumulator[0] = 0;
    m_shadowPeakAccumulator[1] = 0;

    m_debugModeCableId = false;
    m_psocIsInReady = false;

    m_psocPrimaryFunction = E_PsocPrimaryFunction_Undefined;

//    m_psocCommState = E_PsocCommState_Disabled;
    setPsocCommState(E_PsocCommState_Disabled);

    resetOutputs();

    resetPeripherals();
}

PsocHandler::~PsocHandler()
{
}

E_PsocSpiError PsocHandler::execute()
{
    E_PsocSpiError psocError;

    assert(m_gpioPort != NULL);

    // TODO: If there's no pending frame, generate an empty frame.
#ifdef PIPELINED
//    assert(m_requestFrame != NULL);
#else
    assert(m_activeFrame != NULL);
#endif

    // handle incoming requests
#ifdef PIPELINED
    if (m_requestFrame != NULL)
#else
    if (m_activeFrame != NULL)
#endif
    {
        // prepare the next transmit frame
        // TODO: Check if the request frame is NULL, then no request is being made.
#ifdef PIPELINED
        if (m_requestFrame->messageHandler == NULL)
        {
            // clear the start byte, so the psoc will not reply to the message.
            m_requestFrame->transmitBuffer.header.start = 1;
            m_requestFrame->transmitBuffer.header.commandStatus = 0;
        }
#else
        if (m_activeFrame->messageHandler == NULL)
        {
            // clear the start byte, so the psoc will not reply to the message.
            m_activeFrame->transmitBuffer.header.start = 1;
            m_activeFrame->transmitBuffer.header.commandStatus = 0;
        }
#endif

        // lower the cs for the current psoc
        csLow();

//        m_activeFrame->serialNumber = m_activeFrame->transmitBuffer.header.serialNumber;
#ifdef WIN32
		psocError = E_PsocSpiError_Ok;
#else
#ifdef PIPELINED
        psocError = executeCommunication((uint8_t*) &m_requestFrame->transmitBuffer);
#else
        psocError = executeCommunication((uint8_t*) &m_activeFrame->transmitBuffer);
#endif
#endif

#ifdef PIPELINED
        if (m_replyFrame != NULL && m_replyFrame->messageHandler != NULL)
        {
            if (psocError == E_PsocSpiError_Ok)
            {
                m_replyFrame->responseStatus = m_replyFrame->messageHandler->handleReceiveBuffer(this,
                        &m_replyFrame->receiveBuffer, m_replyFrame->serialNumber);

                if (m_replyFrame->responseStatus != E_PsocSpiError_Ok)
                    M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d error %x message Id %x", m_psocIndex,
                            m_replyFrame->responseStatus, m_replyFrame->messageHandler->getPsocCommand());
//                // check if the reply was a blocking request by looking at the semaphore:
//                if (m_activeFrame->completeSemaphore != NULL)
//                    m_activeFrame->completeSemaphore->give();
//                M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d success message Id %x", m_psocIndex, m_replyFrame->messageHandler->getPsocCommand());
            }
            else
            {
                M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d error %x message Id %x", m_psocIndex, psocError,
                        m_replyFrame->messageHandler->getPsocCommand());
                // TODO: Handle error on transmission.
            }
            // check if the reply was a blocking request by looking at the semaphore:
            if (m_replyFrame->completeSemaphore != NULL)
                m_replyFrame->completeSemaphore->give();
        }
        else
        {
            if (m_replyFrame != NULL && m_replyFrame->completeSemaphore != NULL)
                m_replyFrame->completeSemaphore->give();
            M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d error %x", m_psocIndex, psocError);
            // TODO: Handle error on transmission.
        }
#else
        if (psocError == E_PsocSpiError_Ok)
        {
            vTaskDelay(M_DELAY_BETWEEN_READING_REPLY);

            psocError = executeCommunication((uint8_t*) &m_activeFrame->transmitBuffer);

