maoravni/Dev/FEC/Common/PssFramework/Peripherals/PSoC/PsocHandler.cpp
            if (psocError == E_PsocSpiError_Ok)
            {
                m_activeFrame->responseStatus = m_activeFrame->messageHandler->handleReceiveBuffer(this,
                        &m_activeFrame->receiveBuffer, m_activeFrame->serialNumber);

                if (m_activeFrame->responseStatus != E_PsocSpiError_Ok)
                M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d error %x", m_psocIndex, m_activeFrame->responseStatus);
//                // check if the reply was a blocking request by looking at the semaphore:
//                if (m_activeFrame->completeSemaphore != NULL)
//                    m_activeFrame->completeSemaphore->give();
            }
            else
            {
                M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d error %x", m_psocIndex, psocError);
                // TODO: Handle error on transmission.
            }
            // check if the reply was a blocking request by looking at the semaphore:
            if (m_activeFrame->completeSemaphore != NULL)
            m_activeFrame->completeSemaphore->give();
        }
        else
        {
            if (m_activeFrame != NULL && m_activeFrame->completeSemaphore != NULL)
            m_activeFrame->completeSemaphore->give();
            M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d error %x", m_psocIndex, psocError);
            // TODO: Handle error on transmission.
        }
#endif
        // raise the cs back
        csHigh();
    }

    // handle previous reply
//    if (m_replyFrame != NULL)
//    {
//        // handle the data received
//        if (m_replyFrame->messageHandler != NULL)
//        {
//            m_replyFrame->responseStatus = m_replyFrame->messageHandler->handleReceiveBuffer(this,
//                    &m_replyFrame->receiveBuffer, m_replyFrame->serialNumber);
//
//            // check if the reply was a blocking request by looking at the semaphore:
//            if (m_replyFrame->useSemaphore)
//                m_replyFrame->completeSemaphore.give();
//        }
//    }
    // TODO: what if the execute task is not started?

//    m_spiFrameArray[((m_currentSpiFrame + 2) % M_FRAME_ARRAY_SIZE)].messageHandler = NULL;
//    if (freeFrame != NULL)
//        freeFrame->messageHandler = NULL;
//    printQueueState();

    ++m_lastSerialNumber;

#ifdef PIPELINED
    // rearrange the frame pointers:
    // the reply is now free:
    T_SpiFrameStruct *freeFrame = m_replyFrame;
    // the request is next to be replied
    m_replyFrame = m_requestFrame;
    m_requestFrame = NULL;
    if (freeFrame != NULL)
        m_spiFramePool.returnFrame(freeFrame);
#else
    // rearrange the frame pointers:
    T_SpiFrameStruct *freeFrame = m_activeFrame;
    m_activeFrame = NULL;
    if (freeFrame != NULL)
    m_spiFramePool.returnFrame(freeFrame);
#endif

    return psocError;
}

E_PsocSpiError PsocHandler::executeSingleFrameTransfer(uint8_t* transmitBuffer)
{
    E_PsocSpiError result;

    // lower the cs for the current psoc
    //csLow();

    result = executeCommunication(transmitBuffer);
    result = executeCommunication(transmitBuffer);

    // raise the cs back
    //csHigh();

    return result;
}

E_PsocSpiError PsocHandler::executeCommunication(uint8_t *transmitBuffer)
{
    static int NoSpiResponseError = 0;
    // start the DMA data transfer
    PSOC_fullDuplexTransfer(transmitBuffer, M_PSOC_SPI_FRAME_SIZE);

    // wait for the transfer to complete:
    if (xSemaphoreTake(psocSpiResponseCompleteSemaphore, M_SINGLE_FRAME_COMPLETE_TIMEOUT) == pdFALSE)
    {
        M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d: No SPI response, semaphore timeout", m_psocIndex);
        ++NoSpiResponseError;
        // if we encounter enough failures to read the SPI, we need to reset the DMA.
//        if (NoSpiResponseError >= M_NUMBER_OF_DMA_SPI_RETRIES)
//        {
//            // suspend all tasks
        vTaskSuspendAll();
        PSOC_setupSpiWithDma();
        xTaskResumeAll();
//        }
        return E_PsocSpiError_NoSpiResponse;
    }

    // check that the transfer is complete, and no timeout has occured:
    if (!psocSpiResponseBuffer.transferComplete)
    {
        M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d: No slave response, transfer not complete", m_psocIndex);
        return E_PsocSpiError_NoSlaveResponse;
    }

    if (!psocSpiResponseBuffer.crcOk)
    {
//        M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d: CRC Error", m_psocIndex);
        return E_PsocSpiError_CrcError;
    }

    return E_PsocSpiError_Ok;
}

void PsocHandler::setPortAndPin(uint16_t index, GPIO_TypeDef* port, uint16_t pin)
{
    m_gpioPort = port;
    m_gpioPin = pin;
    m_psocIndex = index;
}

E_PsocSpiError PsocHandler::getVersion(CBinarySemaphore* completeSemaphore, T_PsocVersion& version)
{
    T_SpiFrameStruct* frame;

    M_PSOC_REQUEST_PROLOGUE(frame);

    frame->messageHandler = &g_getVersionHandler;
    g_getVersionHandler.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber);

    assert(frame->completeSemaphore == NULL);
    frame->completeSemaphore = completeSemaphore;

    M_PSOC_REQUEST_BLOCKING_EPILOGUE(frame);

    memcpy(&version, &frame->receiveBuffer.data.psocVersion, sizeof(T_PsocVersion));
    M_LOGGER_LOGF(M_LOGGER_LEVEL_DEBUG, "Get Psoc Version: %d: firmware %d.%d.%d.%d --- icd %d.%d.%d.%d board %d", m_psocIndex,
            version.firmwareVersion.split.major, version.firmwareVersion.split.minor,
            version.firmwareVersion.split.build, version.firmwareVersion.split.revision,
            version.protocolVersion.split.major, version.protocolVersion.split.minor,
            version.protocolVersion.split.build, version.protocolVersion.split.revision,
            version.boardType);
    return frame->responseStatus;
}

E_PsocSpiError PsocHandler::getTemperaturePwmDiSensors()
{
    T_SpiFrameStruct* frame;
    M_PSOC_REQUEST_PROLOGUE(frame);

