maoravni/Dev/FEC/Common/PssFramework/Peripherals/PSoC/PsocHandler.cpp
    // assign the semaphore, so that the handler will give it back when the transaction is complete:
    frame->completeSemaphore = NULL;
    frame->messageHandler = &g_readTemperaturePwmDISensorsHandler;
    // todo: pass board voltage
    frame->transmitBuffer.data.psocRequestWithVoltage.voltage = Psc_GetBoardVoltage24V();
    g_readTemperaturePwmDISensorsHandler.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber);
//    frame->
    return E_PsocSpiError_Ok;
}

E_PsocSpiError PsocHandler::getAnalogsFeedbacksErrors()
{
    T_SpiFrameStruct* frame;
    M_PSOC_REQUEST_PROLOGUE(frame);

    // assign the semaphore, so that the handler will give it back when the transaction is complete:
    frame->completeSemaphore = NULL;
    frame->messageHandler = &g_readAnalogsFeedbacksErrors;
    // todo: pass board voltage
    frame->transmitBuffer.data.psocRequestWithVoltage.voltage = Psc_GetBoardVoltage24V();
    g_readAnalogsFeedbacksErrors.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber);
//    frame->
    return E_PsocSpiError_Ok;
}

E_PsocSpiError PsocHandler::updatePsocPwmOutputs()
{
    T_SpiFrameStruct* frame;
    M_PSOC_REQUEST_PROLOGUE(frame);

    // assign the semaphore, so that the handler will give it back when the transaction is complete:
    frame->completeSemaphore = NULL;
    frame->messageHandler = &g_writeMultipleDevices;
    g_writeMultipleDevices.prepareTransmitBufferPwm(&frame->transmitBuffer, m_lastSerialNumber, m_pwmOutputs);

    return E_PsocSpiError_Ok;
}

E_PsocSpiError PsocHandler::updatePsocAnalogOutputs()
{
    T_SpiFrameStruct* frame;
    M_PSOC_REQUEST_PROLOGUE(frame);

    // assign the semaphore, so that the handler will give it back when the transaction is complete:
    frame->completeSemaphore = NULL;
    frame->messageHandler = &g_writeMultipleDevices;
    g_writeMultipleDevices.prepareTransmitBufferAnalogOuts(&frame->transmitBuffer, m_lastSerialNumber, m_analogOutputs);

    return E_PsocSpiError_Ok;
}

bool PsocHandler::verifyPsocOutputs()
{
    if (m_pendingUpdate[E_PsocDeviceType_DigitalPWM] == E_DeviceWriteState_Verify)
    {
        for (int i = 0; i < M_NUM_OF_PWM_OUTPUTS; ++i)
        {
//            if (m_pwmOutputs[i] != m_shadowTemperaturePwmDiValues.pwmOutputsReported[i])
            bool requestedOutputsNotZero = (m_pwmOutputs[i] != 0);
            bool psocOutputsNotZero = (m_shadowTemperaturePwmDiValues.pwmOutputsReported[i]);
            if (!psocOutputsNotZero && requestedOutputsNotZero)
            {
                // retry the write.
                addPendingUpdate(E_PsocDeviceType_DigitalPWM);
                return false;
            }
        }
        m_pendingUpdate[E_PsocDeviceType_DigitalPWM] = E_DeviceWriteState_Idle;
    }
//    if (m_pendingUpdate[E_PsocDeviceType_AnalogOutput] == E_DeviceWriteState_Verify)
//    {
//        for (int i = 0; i < M_NUM_OF_ANALOG_OUTPUTS; ++i)
//        {
//            if (m_analogOutputs[i] != m_shadowTemperaturePwmDiValues.pwmOutputsReported[i])
//            {
//                // retry the write.
//                addPendingUpdate(E_PsocDeviceType_DigitalPWM);
//                return false;
//            }
//        }
//        m_pendingUpdate[E_PsocDeviceType_DigitalPWM] = E_DeviceWriteState_Idle;
//    }
    return true;
}

E_PsocSpiError PsocHandler::configTemperatureSensor(CBinarySemaphore* completeSemaphore, int channelIndex,
        E_PsocTemperatureSensorType channelType, E_PsocTemperatureSensorFilterType filterType, float hardLimit,
        float corrA, float corrB, E_MissingDevicePriority priority)
{
    M_LOGGER_LOGF(M_LOGGER_LEVEL_DEBUG, "configTemperatureSensor: psocIndex=%d channelIndex=%d hardLimit=%f missPrio=%d",
            m_psocIndex, channelIndex, hardLimit, priority);

    T_SpiFrameStruct* frame;
    M_PSOC_REQUEST_PROLOGUE(frame);

    // assign the semaphore, so that the handler will give it back when the transaction is complete:
//    frame->completeSem = &m_blockingRequestSem;
    frame->messageHandler = &g_configTemperatureSensor;
    frame->transmitBuffer.data.configTemperatureSensor.channelIndex = channelIndex;
    frame->transmitBuffer.data.configTemperatureSensor.sensorType = channelType;
    frame->transmitBuffer.data.configTemperatureSensor.hardLimit = hardLimit;
    frame->transmitBuffer.data.configTemperatureSensor.filterType = filterType;
    frame->transmitBuffer.data.configTemperatureSensor.aCoeff = corrA;
    frame->transmitBuffer.data.configTemperatureSensor.bCoeff = corrB;
    frame->transmitBuffer.data.configTemperatureSensor.missingSensorPriority = priority;
    g_configTemperatureSensor.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber);

    M_PSOC_REQUEST_BLOCKING_EPILOGUE(frame);

    return frame->responseStatus;
}

E_PsocSpiError PsocHandler::configCurrentLoop(CBinarySemaphore* completeSemaphore, int channelIndex,
        uint16_t minCurrentLimit, uint16_t maxCurrentLimit)
{
    M_LOGGER_LOGF(M_LOGGER_LEVEL_DEBUG,
            "configCurrentLoop: psocIndex=%d channelIndex=%d minCurrentLimit=%d maxCurrentLimit=%d", m_psocIndex,
            channelIndex, minCurrentLimit, maxCurrentLimit);

    T_SpiFrameStruct* frame;
    M_PSOC_REQUEST_PROLOGUE(frame);

    // assign the semaphore, so that the handler will give it back when the transaction is complete:
//    frame->completeSem = &m_blockingRequestSem;
    frame->messageHandler = &g_configCurrentLoop;
    frame->transmitBuffer.data.configCurrentLoop.channelIndex = channelIndex;
    frame->transmitBuffer.data.configCurrentLoop.minCurrentLimit = minCurrentLimit;
    frame->transmitBuffer.data.configCurrentLoop.maxCurrentLimit = maxCurrentLimit;

    g_configCurrentLoop.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber);

    M_PSOC_REQUEST_BLOCKING_EPILOGUE(frame);

    return frame->responseStatus;
}

E_PsocSpiError PsocHandler::configAnalogIO(CBinarySemaphore* completeSemaphore, int channelIndex,
        uint16_t minCurrentLimit, uint16_t maxCurrentLimit)
{
    M_LOGGER_LOGF(M_LOGGER_LEVEL_DEBUG,
            "configAnalogIO: psocIndex=%d channelIndex=%d minCurrentLimit=%d maxCurrentLimit=%d", m_psocIndex,
            channelIndex, minCurrentLimit, maxCurrentLimit);

    T_SpiFrameStruct* frame;
    M_PSOC_REQUEST_PROLOGUE(frame);

