maoravni/Dev/FEC/Common/PssFramework/Peripherals/PSoC/PsocHandler.cpp
    // assign the semaphore, so that the handler will give it back when the transaction is complete:
//    frame->completeSem = &m_blockingRequestSem;
    frame->messageHandler = &g_configCurrentLoop;
    frame->transmitBuffer.data.configCurrentLoop.channelIndex = channelIndex;
    frame->transmitBuffer.data.configCurrentLoop.minCurrentLimit = minCurrentLimit;
    frame->transmitBuffer.data.configCurrentLoop.maxCurrentLimit = maxCurrentLimit;

    g_configCurrentLoop.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber);

    M_PSOC_REQUEST_BLOCKING_EPILOGUE(frame);

    return frame->responseStatus;
}

E_PsocSpiError PsocHandler::getCableID(CBinarySemaphore* completeSemaphore, uint8_t& cable1, uint8_t& cable2,
        uint8_t& cable3, uint8_t& errorBits)
{
    T_SpiFrameStruct* frame;
    M_PSOC_REQUEST_PROLOGUE(frame);

    // assign the semaphore, so that the handler will give it back when the transaction is complete:
//    frame->completeSem = &m_blockingRequestSem;
    frame->messageHandler = &g_getCableId;
    // TODO: Calc board voltage
    g_getCableId.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber, Psc_GetBoardVoltage24V());

    M_PSOC_REQUEST_BLOCKING_EPILOGUE(frame);

    T_PsocCableIdReply* payload = &frame->receiveBuffer.data.psocCableIdReply;
#ifdef DRYER_DEBUG
    cable1 = m_psocIndex + 1;
    cable2 = m_psocIndex + 1;
    cable3 = m_psocIndex + 1;
    m_cableId = m_psocIndex + 1;
#else
    cable1 = payload->output1Id;
    cable2 = payload->input1Id;
    cable3 = payload->input2Id;
    m_cableId = cable1;
#endif
    errorBits = payload->errorBits;
    M_LOGGER_LOGF(M_LOGGER_LEVEL_DEBUG, "Get Psoc Cable ID: %d: %d %d %d", m_psocIndex, payload->input1Id,
            payload->input2Id, payload->output1Id);
    if (m_debugModeCableId)
    {
        cable1 = m_psocIndex + 1;
        cable2 = m_psocIndex + 1;
        cable3 = m_psocIndex + 1;
        M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "Get ___Debug___ Psoc Cable ID: %d: %d %d %d", m_psocIndex, cable1, cable2,
                cable3);
    }

    return frame->responseStatus;
}

E_PsocSpiError PsocHandler::configDigitalIO(CBinarySemaphore* completeSemaphore, int channelIndex,
        E_DigitalIOType channelType, uint8_t riseStep, uint8_t fallStep, uint8_t riseTime, uint8_t fallTime)
{
    T_SpiFrameStruct* frame;

    M_PSOC_REQUEST_PROLOGUE(frame);

//    M_LOGGER_LOGF(M_LOGGER_LEVEL_DEBUG, "configDigitalIO PSoC %d Channel %d ChannelType %d", m_psocIndex, channelIndex, channelType);
    frame->messageHandler = &g_configDigitalIO;
    frame->transmitBuffer.data.configDigitalIO.channelIndex = channelIndex;
    frame->transmitBuffer.data.configDigitalIO.channelType = channelType;
    frame->transmitBuffer.data.configDigitalIO.RiseStepSize = riseStep;
    frame->transmitBuffer.data.configDigitalIO.FallStepSize = fallStep;
    frame->transmitBuffer.data.configDigitalIO.RiseStepTickCount = riseTime;
    frame->transmitBuffer.data.configDigitalIO.FallStepTickCount = fallTime;

    g_configDigitalIO.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber);

    M_PSOC_REQUEST_BLOCKING_EPILOGUE(frame);

    return frame->responseStatus;

}

//int handlerLastTickCount;
void PsocHandler::updateShadowTemperaturePwmDiValues(T_ReadTemperaturePwmDISensors& sensorValues)
{
    handleSystemStatusBits(sensorValues.systemStatus);

    memcpy(&m_shadowTemperaturePwmDiValues, &sensorValues, sizeof(T_ReadTemperaturePwmDISensors));

    // count the number of times the requested output values are difference than reported:
    if (verifyPsocOutputs())
    {
        if (m_digitalPwmOutputsVerifyErrorCount >= M_ALLOWED_CONSECUTIVE_OUTPUT_DIFFERENCES)
            PscMasterServer::getInstance().sendError(m_cableId, M_PSS_ID_NONE, M_PSS_ID_NONE, 0);
        m_digitalPwmOutputsVerifyErrorCount = 0;
    }
    else
    {
        if (m_digitalPwmOutputsVerifyErrorCount < M_ALLOWED_CONSECUTIVE_OUTPUT_DIFFERENCES)
        {
            ++m_digitalPwmOutputsVerifyErrorCount;
            if (m_digitalPwmOutputsVerifyErrorCount >= M_ALLOWED_CONSECUTIVE_OUTPUT_DIFFERENCES)
                PscMasterServer::getInstance().sendError(m_cableId, M_PSS_ID_NONE, M_PSS_ID_NONE,
                        E_PSSErrors_PsocOutputsNotOpen);
        }
    }
}

E_PsocSpiError PsocHandler::configChannelFunction(CBinarySemaphore* completeSemaphore,
        E_PsocPrimaryFunction channelFunction)
{
    T_SpiFrameStruct* frame;

    M_PSOC_REQUEST_PROLOGUE(frame);

    frame->messageHandler = &g_configChannelFunction;
    frame->transmitBuffer.data.configChannelFunction.primaryFunction = (uint8_t) channelFunction;
    g_configChannelFunction.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber);

    M_PSOC_REQUEST_BLOCKING_EPILOGUE(frame);

    return frame->responseStatus;
}

void PsocHandler::updateShadowAnalogsFeedbacksErrorsValues(T_ReadAnalogsFeedbacksErrors& sensorValues)
{
    handleSystemStatusBits(sensorValues.systemStatus);
    handleSystemErrorBits(sensorValues.systemErrors);
    handleSystemWarningBits(sensorValues.systemWarnings);

    memcpy(&m_shadowAnalogsFeedbacksErrorsValues, &sensorValues, sizeof(T_ReadAnalogsFeedbacksErrors));

    m_shadowPwmControlPulseCounter += m_shadowAnalogsFeedbacksErrorsValues.pwmCounts;
    m_shadowPeakAccumulator[0] += m_shadowAnalogsFeedbacksErrorsValues.peakCurrent[0] * m_shadowPwmControlPulseCounter;
    m_shadowPeakAccumulator[1] += m_shadowAnalogsFeedbacksErrorsValues.peakCurrent[1] * m_shadowPwmControlPulseCounter;
}

void PsocHandler::resetOutputs()
{
    int i;
    for (i = 0; i < M_NUM_OF_PSOC_PWM_OUTPUTS; ++i)
        addPendingPwmOutputValue(i, 0);
    for (i = 0; i < M_NUM_OF_PSOC_ANALOG_OUTPUTS; ++i)
        addPendingAnalogOutputValue(i, 0);

    m_comFailures = 0;
    m_spiComFailures = 0;

}

void PsocHandler::resetCommunications()
{
    m_spiFramePool.reset();
//    m_completeSemaphorePool.reset();
#ifdef PIPELINED
    m_requestFrame = NULL;
    m_replyFrame = NULL;
#else
    m_activeFrame = NULL;
#endif
    setPsocCommState(E_PsocCommState_Enabled);
    //m_psocIsInReady = false;
}

