maoravni/Dev/FEC/Common/PssFramework/Peripherals/PSoC/PsocHandler.cpp
void PsocHandler::resetPeripherals()
{
    m_temperaturePeripheral = NULL;
    m_pwmPeripheral = NULL;
    m_digitalOutPeripheral = NULL;
    m_digitalInPeripheral = NULL;
    m_analogInPeripheral = NULL;
    m_analogOutPeripheral = NULL;
    m_comFailures = 0;
    m_spiComFailures = 0;
    m_nextRequest = E_PsocRequest_ReadTemperaturePwmDi;
    setPsocCommState(E_PsocCommState_Disabled);
//    m_lastOutputsStatus = false;
}

void PsocHandler::enableDebugCableIdMode()
{
    m_debugModeCableId = true;
}

void PsocHandler::addPendingPwmOutputValue(int index, uint16_t value)
{
    m_pwmOutputs[index] = value;
    addPendingUpdate(E_PsocDeviceType_DigitalPWM);
}

void PsocHandler::addPendingAnalogOutputValue(int index, uint16_t value)
{
    m_analogOutputs[index] = value;
    addPendingUpdate(E_PsocDeviceType_AnalogOutput);
}

E_PsocSpiError PsocHandler::updatePendingOutputs()
{
    E_PsocSpiError result;
    E_PsocDeviceType deviceType = getPendingUpdate();

    switch (deviceType)
    {
    case E_PsocDeviceType_DigitalPWM:
//    case E_PsocDeviceType_H_BridgePWM:
        result = updatePsocPwmOutputs();
        break;
    case E_PsocDeviceType_AnalogOutput:
        result = updatePsocAnalogOutputs();
        break;
    }

    if (result == E_PsocSpiError_Ok)
        clearPendingUpdate(deviceType);
    return result;
}

E_PsocSpiError PsocHandler::startErrorRecovery(CBinarySemaphore* completeSemaphore)
{
    T_SpiFrameStruct* frame;
    M_PSOC_REQUEST_PROLOGUE(frame);

// assign the semaphore, so that the handler will give it back when the transaction is complete:
//    frame->completeSem = &m_blockingRequestSem;
    frame->messageHandler = &g_startErrorRecovery;
    g_startErrorRecovery.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber);

    M_PSOC_REQUEST_BLOCKING_EPILOGUE(frame);

    return frame->responseStatus;
}

E_PsocSpiError PsocHandler::startBoardConfig(CBinarySemaphore* completeSemaphore)
{
    T_SpiFrameStruct* frame;
    M_PSOC_REQUEST_PROLOGUE(frame);

// assign the semaphore, so that the handler will give it back when the transaction is complete:
//    frame->completeSem = &m_blockingRequestSem;
    frame->messageHandler = &g_startBoardConfig;
    g_startBoardConfig.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber);

    M_PSOC_REQUEST_BLOCKING_EPILOGUE(frame);

    m_psocIsInReady = false;

    return frame->responseStatus;
}

E_PsocSpiError PsocHandler::endBoardConfig(CBinarySemaphore* completeSemaphore)
{
    T_SpiFrameStruct* frame;
    M_PSOC_REQUEST_PROLOGUE(frame);

// assign the semaphore, so that the handler will give it back when the transaction is complete:
//    frame->completeSem = &m_blockingRequestSem;
    frame->messageHandler = &g_endBoardConfig;
    g_endBoardConfig.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber);

    M_PSOC_REQUEST_BLOCKING_EPILOGUE(frame);

    m_psocIsInReady = true;

    return frame->responseStatus;
}

void PsocHandler::handleSystemStatusBits(uint16_t systemStatus)
{
#define M_CHECK_FOR_SYSTEM_STATUS_ERROR(PSOC_ERROR, PSS_ERROR) if (systemStatus & PSOC_ERROR) PscMasterServer::getInstance().sendError(m_cableId, M_PSS_ID_NONE, M_PSS_ID_NONE, PSS_ERROR)
#define M_CHECK_FOR_SYSTEM_STATUS_WARNING(PSOC_WARNING, PSS_WARNING) if (systemStatus & PSOC_WARNING) PscMasterServer::getInstance().sendWarning(m_cableId, M_PSS_ID_NONE, M_PSS_ID_NONE, PSS_WARNING)
    uint16_t systemStatusWarnings = systemStatus & M_STATUS_BITS_WARNING_MASK;
    uint16_t systemStatusErrors = systemStatus & M_STATUS_BITS_ERROR_MASK;
    if (isPsocIsInReady())
        systemStatusErrors |= systemStatus & M_STATUS_BITS_OPERATION_STATE;
//    uint16_t a = M_STATUS_BITS_WARNING_MASK;
//    uint16_t b = M_STATUS_BITS_ERROR_MASK;

    if (getPsocCommState() != E_PsocCommState_Enabled)
        return;

    if (m_systemStatus == systemStatus)
        return;

    if (systemStatusWarnings != (m_systemStatus & M_STATUS_BITS_WARNING_MASK))
    {
        if (systemStatusWarnings != 0)
        {
            M_LOGGER_LOGF(M_LOGGER_LEVEL_WARNING, "PSoC %d System Status Warnings %x", m_psocIndex,
                    systemStatusWarnings);
            M_CHECK_FOR_SYSTEM_STATUS_WARNING(E_PsocStatusBits_SystemModuleWarning,
                    E_PSSWarnings_PsocSystemModuleWarning);
            M_CHECK_FOR_SYSTEM_STATUS_WARNING(E_PsocStatusBits_TemperatureModuleWarning,
                    E_PSSWarnings_PsocTemperatureModuleWarning);
            M_CHECK_FOR_SYSTEM_STATUS_WARNING(E_PsocStatusBits_AnalogModuleWarning,
                    E_PSSWarnings_PsocAnalogModuleWarning);
            M_CHECK_FOR_SYSTEM_STATUS_WARNING(E_PsocStatusBits_MonitorModuleWarning,
                    E_PSSWarnings_PsocMonitorModuleWarning);
            M_CHECK_FOR_SYSTEM_STATUS_WARNING(E_PsocStatusBits_SafetyModuleWarning,
                    E_PSSWarnings_PsocSafetyModuleWarning);
        }
        else
        {
            if (m_systemStatus)
                M_LOGGER_LOGF(M_LOGGER_LEVEL_WARNING, "PSoC %d System Status No Warnings", m_psocIndex);
            PscMasterServer::getInstance().sendWarning(m_cableId, M_PSS_ID_NONE, M_PSS_ID_NONE, 0);
        }
    }
    if (systemStatusErrors != m_systemStatus & M_STATUS_BITS_ERROR_MASK)
    {
        if (systemStatusErrors != 0)
        {
            M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d System Status Errors %x", m_psocIndex, systemStatusErrors);
            M_CHECK_FOR_SYSTEM_STATUS_ERROR(E_PsocStatusBits_AnalogModuleError, E_PSSErrors_PsocAnalogModuleError);
            M_CHECK_FOR_SYSTEM_STATUS_ERROR(E_PsocStatusBits_SystemModuleError, E_PSSErrors_PsocSystemModuleError);
            M_CHECK_FOR_SYSTEM_STATUS_ERROR(E_PsocStatusBits_TemperatureModuleError,
                    E_PSSErrors_PsocTemperatureModuleError);
            M_CHECK_FOR_SYSTEM_STATUS_ERROR(E_PsocStatusBits_MonitorModuleError, E_PSSErrors_PsocMonitorModuleError);
            M_CHECK_FOR_SYSTEM_STATUS_ERROR(E_PsocStatusBits_SafetyModuleError, E_PSSErrors_PsocSafetyError);
            M_CHECK_FOR_SYSTEM_STATUS_ERROR(E_PsocStatusBits_PsocOffline, E_PSSErrors_PsocNotInOperationalState);
            M_CHECK_FOR_SYSTEM_STATUS_ERROR(E_PsocStatusBits_SystemNotInitialized,
                    E_PSSErrors_PsocNotInOperationalState);
            M_CHECK_FOR_SYSTEM_STATUS_ERROR(E_PsocStatusBits_BITFailed, E_PSSErrors_PsocNotInOperationalState);
            M_CHECK_FOR_SYSTEM_STATUS_ERROR(E_PsocStatusBits_SystemNotConfigured,
                    E_PSSErrors_PsocNotInOperationalState);
        }
        else
        {
            if (m_systemStatus)
                M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d System Status No Errors", m_psocIndex);
            PscMasterServer::getInstance().sendError(m_cableId, M_PSS_ID_NONE, M_PSS_ID_NONE, 0);
        }
    }
    m_systemStatus = systemStatus;
}

void PsocHandler::handleSystemErrorBits(uint16_t systemErrors)
{
//#define M_CHECK_FOR_SYSTEM_ERROR(PSOC_ERROR, PSS_ERROR) if (systemErrors & PSOC_ERROR) PscMasterServer::getInstance().sendError(m_cableId, M_PSS_ID_NONE, M_PSS_ID_NONE, PSS_ERROR)
#define M_CHECK_FOR_SYSTEM_ERROR(PSOC_ERROR, PSS_ERROR) if (errorsXored & PSOC_ERROR) raiseError(PSOC_ERROR, PSS_ERROR, (systemErrors & PSOC_ERROR) != 0)

    if (getPsocCommState() != E_PsocCommState_Enabled)
        return;

    uint16_t errorsXored = systemErrors ^ m_errors;

