maoravni/Dev/FEC/Common/PssFramework/Peripherals/PSoC/PsocHandler.cpp
    if (errorsXored != 0)
    {
//        if (systemErrors != 0)
//        {
            M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d System Error %x", m_psocIndex, systemErrors);
            M_LOGGER_LOGF(M_LOGGER_LEVEL_DEBUG, "Error Xor %x", errorsXored);
            M_CHECK_FOR_SYSTEM_ERROR(E_PsocErrorBits_SafetyRelayLow, E_PSSErrors_PsocSafetyError);
            M_CHECK_FOR_SYSTEM_ERROR(E_PsocErrorBits_HardTemperatureLimit, E_PSSErrors_DeviceExceedsHardLimits);
            M_CHECK_FOR_SYSTEM_ERROR(E_PsocErrorBits_CableIdNotMatching, E_PSSErrors_CableIdNotMatching);
            M_CHECK_FOR_SYSTEM_ERROR(E_PsocErrorBits_Pt100MissingSensor, E_PSSErrors_SensorMalfunction);
            M_CHECK_FOR_SYSTEM_ERROR(E_PsocErrorBits_Pt100CalResistorError, E_PSSErrors_SensorMalfunction);
            M_CHECK_FOR_SYSTEM_ERROR(E_PsocErrorBits_SoftTemperatureLimit, E_PSSErrors_DeviceExceedsSoftLimits);
            M_CHECK_FOR_SYSTEM_ERROR(E_PsocErrorBits_SsrOverheating, E_PSSErrors_SsrOverheating);
            M_CHECK_FOR_SYSTEM_ERROR(E_PsocErrorBits_MissingCurrentSensor, E_PSSErrors_SensorMalfunction);
            M_CHECK_FOR_SYSTEM_ERROR(E_PsocErrorBits_SsrAlwaysOn, E_PSSErrors_SsrAlwaysOn);
            M_CHECK_FOR_SYSTEM_ERROR(E_PsocErrorBits_OverCurrentLimit, E_PSSErrors_CurrentLoopAboveLimit);
            M_CHECK_FOR_SYSTEM_ERROR(E_PsocErrorBits_PrintBarLifted, E_PSSErrors_PrintBarLifted);
            M_CHECK_FOR_SYSTEM_ERROR(E_PsocErrorBits_LiquidDetectorError, E_PSSErrors_PsocLiquidDetectorError);
            //            M_CHECK_FOR_SYSTEM_WARNING(E_PsocWarningBits_MissingTemperatureSensor,
            //                    E_PSSWarnings_PsocMissingTemperatureSensor);
//        }
//        else
//        {
//            M_LOGGER_LOGF(M_LOGGER_LEVEL_ERROR, "PSoC %d System Error No Errors", m_psocIndex);
//            PscMasterServer::getInstance().sendError(m_cableId, M_PSS_ID_NONE, M_PSS_ID_NONE, 0);
//        }
    }
    m_errors = systemErrors;
}

void PsocHandler::handleSystemWarningBits(uint16_t systemWarnings)
{
#define M_CHECK_FOR_SYSTEM_WARNING(PSOC_WARNING, PSS_WARNING) if (systemWarnings & PSOC_WARNING) PscMasterServer::getInstance().sendWarning(m_cableId, M_PSS_ID_NONE, M_PSS_ID_NONE, PSS_WARNING)

    if (getPsocCommState() != E_PsocCommState_Enabled)
        return;

    if (systemWarnings != m_warnings)
    {
        if (systemWarnings != 0)
        {
            M_LOGGER_LOGF(M_LOGGER_LEVEL_WARNING, "PSoC %d System Warning %x", m_psocIndex, systemWarnings);
//            M_CHECK_FOR_SYSTEM_WARNING(E_PsocWarningBits_LargeTemperatureVariation,
//                    E_PSSWarnings_PsocLargeTemperatureVariation);
//            M_CHECK_FOR_SYSTEM_WARNING(E_PsocWarningBits_MissingTemperatureSensor,
//                    E_PSSWarnings_PsocMissingTemperatureSensor);
            M_CHECK_FOR_SYSTEM_WARNING(E_PsocWarningBits_SsrAlwaysOff, E_PSSWarnings_PsocSsrAlwaysOff);
            M_CHECK_FOR_SYSTEM_WARNING(E_PsocWarningBits_SsrOverheating, E_PSSWarnings_PsocSsrHighTemperature);
        }
        else
        {
            M_LOGGER_LOGF(M_LOGGER_LEVEL_WARNING, "PSoC %d System Error No Warnings", m_psocIndex);
            PscMasterServer::getInstance().sendWarning(m_cableId, M_PSS_ID_NONE, M_PSS_ID_NONE, 0);
        }
    }
    m_warnings = systemWarnings;
}

E_PsocSpiError PsocHandler::psocMessagePrologue(T_SpiFrameStruct* frame)
{
    frame = popFrameFromPool();
    if (frame == NULL)
    {
        M_LOGGER_LOGF(M_LOGGER_LEVEL_FATAL, "---No empty frame!---");
        return E_PsocSpiError_HandlerFrameOverwritten;
    }

    return E_PsocSpiError_Ok;
}

E_PsocSpiError PsocHandler::startPsocBootloader()
{
    T_SpiFrameStruct* frame;

    M_PSOC_REQUEST_PROLOGUE(frame);

    frame->messageHandler = &g_startBootloader;
    g_startBootloader.prepareTransmitBuffer(&frame->transmitBuffer, m_lastSerialNumber);

    E_PsocSpiError result = executeSingleFrameTransfer((uint8_t*) &frame->transmitBuffer);

    return result;
}

void PsocHandler::raiseError(E_PsocErrorBits psocError, E_PSSErrors pssError, bool state)
{
    uint16_t lastError = m_errors;

    if (state)
        m_errors |= psocError;
    else
        m_errors &= ~psocError;

    if (m_errors != lastError)
    {
//        M_LOGGER_LOGF(M_LOGGER_LEVEL_DEBUG, "Sending PSoC error %x / PSS Error %x state %d for PSoC %d", psocError, pssError, state, m_psocIndex);
        PscMasterServer::getInstance().sendError(m_cableId, M_PSS_ID_NONE, M_PSS_ID_NONE, m_errors);
        delegateErrorToPeripheral(psocError, state);
    }
}

void PsocHandler::raiseWarning(E_PsocWarningBits warning, bool state)
{
}

void PsocHandler::raiseSystemStatus(E_PsocStatusBits statusBit, bool state)
{
}

void PsocHandler::delegateErrorToPeripheral(E_PsocErrorBits error, bool state)
{
#define M_DELEGATE_ERROR_TO_PERIPHERAL(p, e, s) if (p != NULL) p->raiseError(e, s)

    M_DELEGATE_ERROR_TO_PERIPHERAL(m_temperaturePeripheral, error, state);
    M_DELEGATE_ERROR_TO_PERIPHERAL(m_pwmPeripheral, error, state);
    M_DELEGATE_ERROR_TO_PERIPHERAL(m_analogOutPeripheral, error, state);
    M_DELEGATE_ERROR_TO_PERIPHERAL(m_digitalOutPeripheral, error, state);
    M_DELEGATE_ERROR_TO_PERIPHERAL(m_digitalInPeripheral, error, state);
    M_DELEGATE_ERROR_TO_PERIPHERAL(m_analogInPeripheral, error, state);
}

void PsocHandler::delegateWarningToPeripheral(E_PSSWarnings warning, bool state)
{
#define M_DELEGATE_WARNING_TO_PERIPHERAL(p, e, s) if (p != NULL) p->raiseWarning(e, s)

    M_DELEGATE_WARNING_TO_PERIPHERAL(m_temperaturePeripheral, warning, state);
    M_DELEGATE_WARNING_TO_PERIPHERAL(m_pwmPeripheral, warning, state);
    M_DELEGATE_WARNING_TO_PERIPHERAL(m_analogOutPeripheral, warning, state);
    M_DELEGATE_WARNING_TO_PERIPHERAL(m_digitalOutPeripheral, warning, state);
    M_DELEGATE_WARNING_TO_PERIPHERAL(m_digitalInPeripheral, warning, state);
    M_DELEGATE_WARNING_TO_PERIPHERAL(m_analogInPeripheral, warning, state);
}
